Documents/абс_ВводНормыРасходовНаТранспорт/абс_ВводНормыРасходовНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ВводНормыРасходовНаТранспорт</name>
  <registerRecords>InformationRegister.абс_НормыРасходовНаТранспорт</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Регионы</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/абс_НормыРасходовНаТранспорт/абс_НормыРасходовНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_НормыРасходовНаТранспорт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/абс_ВводНормыРасходовНаТранспорт/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения)
	
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр абс_НормыРасходовНаТранспорт
	Движения.абс_НормыРасходовНаТранспорт.Записывать = Истина;
	Движения.абс_НормыРасходовНаТранспорт.Очистить();
	Для Каждого ТекСтрокаРегионы Из Регионы Цикл
		Движение = Движения.абс_НормыРасходовНаТранспорт.Добавить();
		Движение.Период = Дата;
		Движение.Регион = ТекСтрокаРегионы.Регион;
		Движение.Сумма = ТекСтрокаРегионы.Сумма;
	КонецЦикла;

КонецПроцедуры
